// 1. 작은 이미지 마우스 올리면 opacity 낮아짐
// 2. 작은 이미지 클릭 시, 검은색 테두리 & 큰 이미지 슬라이드 & 아래 페이지네이션 움직이기
// 3. 이미지 상하 이동 버튼 클릭 시 작은 이미지 슬라이드
// 4. 공유하기 버튼에 마우스 올리면 투명해지고, 버튼 클릭하면 공유하기 팝업
// 5. 헤택가 우측 버튼 누르면 말풍선 박스 뜸
// 6. 혜택 안내 부분 마우스로 클릭 후 이동 시 슬라이드
// 7. 수량 조정하면 가격 & 수량정보 (버튼 & 텍스트 둘 다) 바뀜
// 8. 수량 5개까지만 클릭 가능, 이상부터는 '최대 주문수량은 5개 입니다' 팝업창
// 9. 수량 1개 이상 클릭 가능, 1개 미만 클릭 시도 시 '최소 주문수량은 1개 입니다.' 팝업창
// 10. 위시 버튼 클릭 시 하트 검은색으로 바뀜
// 11. 장바구니, 바로구매 클릭 시 로그아웃 상태면 '회원 혹은 일부 회원등급만 구매 가능합니다. 비회원인 경우 회원가입 후 이용해주세요. 팝업창 ->
// 12. 위 팝업창에서 확인 누르면 로그인 페이지로 이동, 로그인 상태면 각각 페이지로 이동

// 1. 작은 이미지 마우스 올리면 opacity 낮아짐
/* const smallImageA = document.querySelectorAll('.small_images');
smallImageA.addEvent */
